import pandas as pd

def calc(df):

    df["勝"] = 0

    df.loc[df["所属"]=="栗東","勝"] = df["勝"] + 1
    df.loc[(df["開催"]=="福島") & (df["所属"]=="栗東"),"勝"] = df["勝"] + 1
    df.loc[df["地方"]!=1,"勝"] = df["勝"] + 100
    df.loc[df["国際"]==1,"勝"] = df["勝"] + 1

    df.loc[(df["年齢"]>5),"勝"] = df["勝"] + 1
    df.loc[(df["年齢"]==2),"勝"] = df["勝"] + 1
    df.loc[(df["日付-生年月日"]<365*2.5),"勝"] = df["勝"] + 1
    df.loc[df["毛色"]=="青鹿毛","勝"] = df["勝"] + 1

    df.loc[(df["馬体重"] >= 450),"勝"] = df["勝"] + 1
    df.loc[(df["馬体重の差分"]>10),"勝"] = df["勝"] + 1
    df.loc[(df["馬体重の差分"]>-10),"勝"] = df["勝"] + 1
    df.loc[(df["斤量-1前"] > 0),"勝"] = df["勝"] + 1

    df.loc[df["馬番奇数"]==False,"勝"] = df["勝"] + 1

    # 騎手・調教師
    df.loc[(df["騎手"]=="池添謙一"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="和田竜二"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="内田博幸"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="岩田康誠"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="藤田菜七"),"勝"] = df["勝"] + 1

    df.loc[(df["1前着順"]>=4),"勝"] = df["勝"] + 1
    df.loc[(df["1前着差"]>=2.0) & (df["1前着差"]<3.0),"勝"] = df["勝"] + 1
    df.loc[(df["1前着差"]>=0.5) & (df["1前着差"]<1.0),"勝"] = df["勝"] + 1
    df.loc[(df["1前人気"]==1) & (df["レース条件"]=="未勝利"),"勝"] = df["勝"] + 1    
    df.loc[(df["1前ペース(前半)"] >= df["1前ペース(後半)"]),"勝"] = df["勝"] + 1
    df.loc[(df["1前レース間隔"]>90),"勝"] = df["勝"] + 1


    df.loc[(df["1前開催"]!="中山"),"勝"] = df["勝"] + 1
    df.loc[(df["1前開催"]=="京都"),"勝"] = df["勝"] + 1
    df.loc[df["1前馬場"]!="不良","勝"] = df["勝"] + 1
    df.loc[df["1前馬場"]=="稍重","勝"] = df["勝"] + 1
    df.loc[df["1前不利"]==True,"勝"] = df["勝"] + 1

    df.loc[(df["馬名_出走回数"]==1),"勝"] = df["勝"] + 1
    df.loc[(df["馬名_出走回数"]>=5) & (df["馬名_出走回数"]<=7),"勝"] = df["勝"] + 1
    df.loc[(df["馬名_騎手_出走回数"] >= 5),"勝"] = df["勝"] + 1

    return df


def calc_demo2(df):

    df["勝"] = 0

    df.loc[df["所属"]=="栗東","勝"] = df["勝"] + 1
    df.loc[(df["開催"]=="福島") & (df["所属"]=="栗東"),"勝"] = df["勝"] + 1
    df.loc[(df["開催"]=="京都") & (df["所属"]=="美浦"),"勝"] = df["勝"] + 1
    df.loc[(df["開催"]=="阪神") & (df["所属"]=="美浦"),"勝"] = df["勝"] + 1
    df.loc[(df["開催"]=="小倉") & (df["所属"]=="美浦"),"勝"] = df["勝"] + 1
    df.loc[(df["1前開催"]=="京都") & (df["所属"]=="栗東"),"勝"] = df["勝"] + 1

    df.loc[df["地方"]!=1,"勝"] = df["勝"] + 100
    df.loc[df["国際"]==1,"勝"] = df["勝"] + 1

    df.loc[(df["年齢"]>5),"勝"] = df["勝"] + 1
    df.loc[(df["年齢"]==2),"勝"] = df["勝"] + 1
    df.loc[(df["日付-生年月日"]<365*2.5),"勝"] = df["勝"] + 1
    df.loc[df["毛色"]=="青鹿毛","勝"] = df["勝"] + 1

    df.loc[(df["馬体重"] >= 450),"勝"] = df["勝"] + 1
    df.loc[(df["馬体重の差分"]>10),"勝"] = df["勝"] + 1
    df.loc[(df["馬体重の差分"]>-10),"勝"] = df["勝"] + 1
    df.loc[(df["斤量-1前"] > 0),"勝"] = df["勝"] + 1

    df.loc[df["馬番奇数"]==False,"勝"] = df["勝"] + 1

    # 騎手・調教師
    df.loc[(df["騎手"]=="池添謙一"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="和田竜二"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="内田博幸"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="岩田康誠"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="藤田菜七"),"勝"] = df["勝"] + 1

    df.loc[(df["1前着順"]>=4),"勝"] = df["勝"] + 1
    df.loc[(df["1前着差"]>=2.0) & (df["1前着差"]<3.0),"勝"] = df["勝"] + 1
    df.loc[(df["1前着差"]>=0.5) & (df["1前着差"]<1.0),"勝"] = df["勝"] + 1
    df.loc[(df["1前人気"]==1) & (df["レース条件"]=="未勝利"),"勝"] = df["勝"] + 1    
    df.loc[(df["1前ペース(前半)"] >= df["1前ペース(後半)"]),"勝"] = df["勝"] + 1
    df.loc[(df["1前レース間隔"]>90),"勝"] = df["勝"] + 1


    df.loc[(df["1前開催"]!="中山"),"勝"] = df["勝"] + 1
    df.loc[(df["2前開催"]!="中山"),"勝"] = df["勝"] + 1
    df.loc[df["1前馬場"]!="不良","勝"] = df["勝"] + 1
    df.loc[df["1前馬場"]=="稍重","勝"] = df["勝"] + 1
    df.loc[df["1前不利"]==True,"勝"] = df["勝"] + 1

    df.loc[(df["馬名_出走回数"]==1),"勝"] = df["勝"] + 1
    df.loc[(df["馬名_出走回数"]>=5) & (df["馬名_出走回数"]<=7),"勝"] = df["勝"] + 1
    df.loc[(df["馬名_騎手_出走回数"] >= 5),"勝"] = df["勝"] + 1

    return df

def calc_demo(df):

    df["勝"] = 0

    df.loc[(df["所属"]=="栗東"),"勝"] = df["勝"] + 1
    df.loc[(df["所属"]=="栗東") & (df["開催"]=="福島"),"勝"] = df["勝"] + 1
    df.loc[(df["所属"]=="栗東") & (df["開催"]!="東京"),"勝"] = df["勝"] + 1
    df.loc[df["地方"]!=1,"勝"] = df["勝"] + 100
    df.loc[df["国際"]==1,"勝"] = df["勝"] + 1

    df.loc[(df["年齢"]<=5),"勝"] = df["勝"] + 1
    df.loc[(df["年齢"]==2),"勝"] = df["勝"] + 1
    df.loc[(df["日付-生年月日"]<365*2.5),"勝"] = df["勝"] + 1
    df.loc[df["毛色"]=="青鹿毛","勝"] = df["勝"] + 1
 
    df.loc[(df["馬体重"] >= 450),"勝"] = df["勝"] + 1
    df.loc[(df["馬体重の差分"]>10),"勝"] = df["勝"] + 1
    df.loc[(df["馬体重の差分"]>-10),"勝"] = df["勝"] + 1
    df.loc[(df["斤量"]<=53),"勝"] = df["勝"] + 1
    df.loc[(df["斤量-1前"] > 0),"勝"] = df["勝"] + 1

    # レース条件
    df.loc[df["馬番奇数"]==False,"勝"] = df["勝"] + 1

    # 騎手・調教師
    df.loc[(df["騎手"]=="池添謙一"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="和田竜二"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="内田博幸"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="岩田康誠"),"勝"] = df["勝"] + 1
    df.loc[(df["騎手"]!="藤田菜七"),"勝"] = df["勝"] + 1


    # 過去5走
    df.loc[(df["1前着順"] < 10) & (df["1前着順"]>=4),"勝"] = df["勝"] + 1
    df.loc[(df["1前着差"]>=2.0) & (df["1前着差"]<3.0),"勝"] = df["勝"] + 1
    df.loc[(df["1前着差"]>=0.5) & (df["1前着差"]<1.0),"勝"] = df["勝"] + 1
    df.loc[(df["1前人気"]==1) & (df["レース条件"]=="未勝利"),"勝"] = df["勝"] + 1    
    df.loc[(df["1前ペース(前半)"] >= df["1前ペース(後半)"]),"勝"] = df["勝"] + 1
    df.loc[(df["1前レース間隔"]>89),"勝"] = df["勝"] + 1
    df.loc[(df["1前レース間隔"]<26),"勝"] = df["勝"] + 1

    # 過去5走条件
    df.loc[df["1前馬場"]!="不良","勝"] = df["勝"] + 1
    df.loc[df["1前馬場"]=="稍重","勝"] = df["勝"] + 1

    df.loc[(df["1前開催"]!="中山"),"勝"] = df["勝"] + 1
    df.loc[(df["1前開催"]=="京都"),"勝"] = df["勝"] + 1
    df.loc[(df["1前開催"]=="札幌"),"勝"] = df["勝"] + 1
    df.loc[(df["1前開催"]=="福島"),"勝"] = df["勝"] + 1

    df.loc[df["1前不利"]==True,"勝"] = df["勝"] + 1
    df.loc[df["1前レース条件"]=="名前付き","勝"] = df["勝"] + 1

    df.loc[df["1前距離カテゴリ"]!="ダ_短距離","勝"] = df["勝"] + 1
    df.loc[df["1前距離カテゴリ"]!="芝_短距離","勝"] = df["勝"] + 1
    df.loc[df["1前距離カテゴリ"]!="ダ_中距離","勝"] = df["勝"] + 1
    df.loc[df["1前距離カテゴリ"]=="ダ_マイル","勝"] = df["勝"] + 1

    # 出走回数
    df.loc[(df["馬名_出走回数"]==1),"勝"] = df["勝"] + 1
    df.loc[(df["馬名_出走回数"]>=5) & (df["馬名_出走回数"]<=7),"勝"] = df["勝"] + 1
    df.loc[(df["馬名_騎手_出走回数"] >= 5),"勝"] = df["勝"] + 1


    return df
